org/blog.org
#+title: ORG Content
#+author: Victor Dorneanu
#+startup: indent fold
#+hugo_base_dir: ../
#+hugo_section: posts
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: %sidenote
#+property: header-args :eval never-export

#+macro: zk [[https://brainfck.org/#$1][$2]]
#+macro: bib [[https://brainfck.org/bib.html#$1][$2]]
#+macro: relref @@hugo:[@@ $1 @@hugo:]({{< relref "$2" >}})@@
#+macro: titleref @@hugo:{{< titleref "$1" "@@ $2 @@hugo:" >}}@@


** DONE TiddlyWiki and Emacs                                                   :emacs:tiddlywiki:elisp:
CLOSED: [2022-07-12 Tue 07:00]
:PROPERTIES:
:EXPORT_FILE_NAME: 2022-tiddlywiki-and-emacs
:END:
Since my [[https://www.reddit.com/r/emacs/comments/pkuhqd/emacs_and_tiddlywiki_anyone/][last post on reddit]] asking for some help regarding Emacs and TiddlyWikis REST API
I gained some ~elisp~ knowledge I'd like to share.
#+begin_sidenote
Maybe you want to go directly to the [[https://github.com/dorneanu/dotfiles/blob/master/dot_doom.d/config.org#tiddlywiki][Emacs configuration]].
#+end_sidenote

*** TiddlyWiki 5
For those of you who haven't heard of TiddlyWiki yet:
#+begin_quote
TiddlyWiki is a personal wiki and a non-linear notebook for organising and
sharing complex information. It is an open-source single page application wiki
in the form of a single HTML file that includes CSS, JavaScript, and the
content. It is designed to be easy to customize and re-shape depending on
application. It facilitates re-use of content by dividing it into small pieces
called Tiddlers. -- [[https://en.wikipedia.org/wiki/TiddlyWiki][Wikipedia]]
#+end_quote

You use the wiki as a *single HTML page* or via ~nodejs~. With ~nodejs~ we can talk to
Tiddlywiki via its REST API.
#+begin_sidenote
I've been using TiddlyWikis REST API to serve a instance via AWS Lambda and DynamoDB
for the data storage. The project itself is called [[https://github.com/dorneanu/widdly][widdly]] and there is also a demo at
[[https://tiddly.info/serverless][tiddly.info/serverless]].
#+end_sidenote


Every single page inside the wiki is called ~tiddler~.

#+begin_quote
On the philosophy of [[https://tiddlywiki.com/static/Philosophy%2520of%2520Tiddlers.html][tiddlers]]: "The purpose of recording and organising information is so that it can be used again. The value of recorded information is directly proportional to the ease with which it can be re-used."
#+end_quote

A ~tiddler~ has following [[https://tiddlywiki.com/prerelease/static/TiddlyWeb%2520JSON%2520tiddler%2520format.html][format]]:

#+caption: Tiddler JSON format
#+begin_src json :exports code
{
	"title": "HelloThere",
	"tags": "FirstTag [[Second Tag]]",
	"my-custom-field": "Field value"
}
#+end_src

Next I'll show you how to setup your TiddlyWiki instance.
#+begin_sidenote
I have a public "digital garden" aka wiki available at https://brainfck.org
#+end_sidenote
**** Basic setup
I use ~node.js~ to run my TiddlyWiki instance.
#+begin_sidenote
The REST API is only available within the nodeJS environment.
#+end_sidenote

For isolation reasons I use ~Docker~ to run it. Here is my ~Dockerfile~:

#+name: tw5_dockerfile
#+caption: Dockerfile for running TiddlyWiki 5 using alpine
#+begin_src docker
FROM mhart/alpine-node

# Create a group and user
RUN addgroup -g 984 -S appgroup
RUN adduser -h /DATA/wiki -u 1000 -S appuser -G appgroup

# Tell docker that all future commands should run as the appuser user

ENV TW_BASE=/DATA TW_NAME=wiki TW_USER="xxx" TW_PASSWORD="xxx" TW_LAZY=""
ENV TW_PATH ${TW_BASE}/${TW_NAME}

WORKDIR ${TW_BASE}

RUN npm install -g npm@8.10.0
RUN npm install -g tiddlywiki http-server

# COPY plugins/felixhayashi /usr/lib/node_modules/tiddlywiki/plugins/felixhayashi
# RUN ls -la /usr/lib/node_modules/tiddlywiki/plugins
COPY start.sh ${TW_BASE}

# Change ownership
RUN chown appuser:appgroup /DATA/start.sh

EXPOSE 8181

USER appuser

ENTRYPOINT ["/DATA/start.sh"]
CMD ["/DATA/start.sh"]
#+end_src

And as for ~start.sh~:

#+name: tw5_docker_start_sh
#+caption: Bash script to start a simple http-server (for uploading images) and the tiddlywiki server instance (node.js)
#+begin_src sh
#!/usr/bin/env sh

# Start image server
http-server -p 82 /DATA/wiki/images &

# Start tiddlywiki server
tiddlywiki /DATA/wiki --listen port=8181 host=0.0.0.0 csrf-disable=yes
#+end_src

Now you should be able to call the API (via ~curl~ for example):

#+name: tw5_get_tiddler_emacs
#+caption: Now you should be able to call the API (via ~curl~ for example).
#+begin_src sh :exports both :results output code
curl http://127.0.0.1:8181/recipes/default/tiddlers/Emacs | jq
#+end_src

#+RESULTS:
#+name: tw5_get_tiddler_emacs_response
#+caption: The REST API will send back a JSON response.
#+begin_src sh
{
  "title": "Emacs",
  "created": "20210623082136326",
  "modified": "20210623082138258",
  "tags": "Topics",
  "type": "text/vnd.tiddlywiki",
  "revision": 0,
  "bag": "default"
}
#+end_src

*** request.el
I use [[https://tkf.github.io/emacs-request/][request.el]]

#+begin_sidenote
I know there might be better alternatives. But in my case it's been totally
sufficient and Elisp beginner friendly.
#+end_sidenote

for crafting and sending HTTP requests. So what is ~request.el~ all about?

#+begin_quote
Request.el is a HTTP request library with multiple backends. It supports url.el
which is shipped with Emacs and curl command line program. User can use curl
when s/he has it, as curl is more reliable than url.el. Library author can use
request.el to avoid imposing external dependencies such as curl to users while
giving richer experience for users who have curl. -- [[https://tkf.github.io/emacs-request/][Source]]
#+end_quote

**** GET
Let's have a look how a simple (GET) API call looks like:

#+name: request_get_chuck_norris
#+caption: Get a random Chuck Norris joke
#+begin_src emacs-lisp :exports both replace :results value code
(let*
    ((httpRequest
      (request "https://api.chucknorris.io/jokes/random"
        :parser 'json-read
        :sync t                      
        :success (cl-function
                  (lambda (&key data &allow-other-keys)
                    (message "I sent: %S" data)))))

     (data (request-response-data httpRequest)))

  ;; Print information
 (cl-loop for (key . value) in data
      collect (cons key value)))
#+end_src

#+RESULTS: request_get_chuck_norris
#+begin_src emacs-lisp
((categories .
             [])
 (created_at . "2020-01-05 13:42:19.576875")
 (icon_url . "https://assets.chucknorris.host/img/avatar/chuck-norris.png")
 (id . "YNmylryESKCeA5-TJKm_9g")
 (updated_at . "2020-01-05 13:42:19.576875")
 (url . "https://api.chucknorris.io/jokes/YNmylryESKCeA5-TJKm_9g")
 (value . "The descendents of Chuck Norris have divided into two widely known cultures: New Jersey and New York."))
#+end_src


#+RESULTS:
#+caption: GET response as a list of cons cells
#+name: request_get_chuck_norris_response
#+begin_src emacs-lisp
((categories . [])
 (created_at . "2020-01-05 13:42:28.420821")
 (icon_url . "https://assets.chucknorris.host/img/avatar/chuck-norris.png")
 (id . "gpw8M-DVSnCpMFit_e0_pA")
 (updated_at . "2020-01-05 13:42:28.420821")
 (url . "https://api.chucknorris.io/jokes/gpw8M-DVSnCpMFit_e0_pA")
 (value . "What killed off the dinosaurs, go ask Chuck Norris."))
#+end_src

