content/posts/2022-tiddlywiki-and-emacs.md
+++
title = "TiddlyWiki and Emacs"
author = ["Victor Dorneanu"]
date = 2022-07-12T07:00:00+02:00
lastmod = 2022-07-13T15:49:41+02:00
tags = ["emacs", "tiddlywiki", "elisp"]
draft = false
+++

Since my [last post on reddit](https://www.reddit.com/r/emacs/comments/pkuhqd/emacs_and_tiddlywiki_anyone/) asking for some help regarding Emacs and TiddlyWikis REST API
I gained some `elisp` knowledge I'd like to share.
{{% sidenote %}}
Maybe you want to go directly to the [Emacs configuration](https://github.com/dorneanu/dotfiles/blob/master/dot_doom.d/config.org#tiddlywiki).
{{% /sidenote %}}


## TiddlyWiki 5 {#tiddlywiki-5}

For those of you who haven't heard of TiddlyWiki yet:

> TiddlyWiki is a personal wiki and a non-linear notebook for organising and
> sharing complex information. It is an open-source single page application wiki
> in the form of a single HTML file that includes CSS, JavaScript, and the
> content. It is designed to be easy to customize and re-shape depending on
> application. It facilitates re-use of content by dividing it into small pieces
> called Tiddlers. -- [Wikipedia](https://en.wikipedia.org/wiki/TiddlyWiki)

You use the wiki as a **single HTML page** or via `nodejs`. With `nodejs` we can talk to
Tiddlywiki via its REST API.
{{% sidenote %}}
I've been using TiddlyWikis REST API to serve a instance via AWS Lambda and DynamoDB
for the data storage. The project itself is called [widdly](https://github.com/dorneanu/widdly) and there is also a demo at
[tiddly.info/serverless](https://tiddly.info/serverless).
{{% /sidenote %}} Every single page inside the wiki is called `tiddler`.

> On the philosophy of [tiddlers](https://tiddlywiki.com/static/Philosophy%2520of%2520Tiddlers.html): "The purpose of recording and organising information is so that it can be used again. The value of recorded information is directly proportional to the ease with which it can be re-used."

A `tiddler` has following [format](https://tiddlywiki.com/prerelease/static/TiddlyWeb%2520JSON%2520tiddler%2520format.html):

```json
{
	"title": "HelloThere",
	"tags": "FirstTag [[Second Tag]]",
	"my-custom-field": "Field value"
}
```

<div class="src-block-caption">
  <span class="src-block-number">Code Snippet 1:</span>
  Tiddler JSON format
</div>

Next I'll show you how to setup your TiddlyWiki instance.
{{% sidenote %}}
I have a public "digital garden" aka wiki available at <https://brainfck.org>
{{% /sidenote %}}


### Basic setup {#basic-setup}

I use `node.js` to run my TiddlyWiki instance.
{{% sidenote %}}
The REST API is only available within the nodeJS environment.
{{% /sidenote %}} For isolation reasons I use `Docker` to run it. Here is my `Dockerfile`:

<a id="code-snippet--tw5-dockerfile"></a>
```docker
FROM mhart/alpine-node

# Create a group and user
RUN addgroup -g 984 -S appgroup
RUN adduser -h /DATA/wiki -u 1000 -S appuser -G appgroup

# Tell docker that all future commands should run as the appuser user

ENV TW_BASE=/DATA TW_NAME=wiki TW_USER="xxx" TW_PASSWORD="xxx" TW_LAZY=""
ENV TW_PATH ${TW_BASE}/${TW_NAME}

WORKDIR ${TW_BASE}

RUN npm install -g npm@8.10.0
RUN npm install -g tiddlywiki http-server

# COPY plugins/felixhayashi /usr/lib/node_modules/tiddlywiki/plugins/felixhayashi
# RUN ls -la /usr/lib/node_modules/tiddlywiki/plugins
COPY start.sh ${TW_BASE}

# Change ownership
RUN chown appuser:appgroup /DATA/start.sh

EXPOSE 8181

USER appuser

ENTRYPOINT ["/DATA/start.sh"]
CMD ["/DATA/start.sh"]
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--tw5-dockerfile">Code Snippet 2</a>:</span>
  Dockerfile for running TiddlyWiki 5 using alpine
</div>

And as for `start.sh`:

<a id="code-snippet--tw5-docker-start-sh"></a>
```sh
#!/usr/bin/env sh

# Start image server
http-server -p 82 /DATA/wiki/images &

# Start tiddlywiki server
tiddlywiki /DATA/wiki --listen port=8181 host=0.0.0.0 csrf-disable=yes
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--tw5-docker-start-sh">Code Snippet 3</a>:</span>
  Bash script to start a simple http-server (for uploading images) and the tiddlywiki server instance (node.js)
</div>

Now you should be able to call the API (via `curl` for example):

<a id="code-snippet--tw5-get-tiddler-emacs"></a>
```sh
curl http://127.0.0.1:8181/recipes/default/tiddlers/Emacs | jq
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--tw5-get-tiddler-emacs">Code Snippet 4</a>:</span>
  Now you should be able to call the API (via <code>curl</code> for example).
</div>

<a id="code-snippet--tw5-get-tiddler-emacs-response"></a>
```sh
{
  "title": "Emacs",
  "created": "20210623082136326",
  "modified": "20210623082138258",
  "tags": "Topics",
  "type": "text/vnd.tiddlywiki",
  "revision": 0,
  "bag": "default"
}
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--tw5-get-tiddler-emacs-response">Code Snippet 5</a>:</span>
  The REST API will send back a JSON response.
</div>


## request.el {#request-dot-el}

I use [request.el](https://tkf.github.io/emacs-request/)
{{% sidenote %}}
I know there might be better alternatives. But in my case it's been totally
sufficient and Elisp beginner friendly.
{{% /sidenote %}} for crafting and sending HTTP requests. So what is `request.el` all about?

> Request.el is a HTTP request library with multiple backends. It supports url.el
> which is shipped with Emacs and curl command line program. User can use curl
> when s/he has it, as curl is more reliable than url.el. Library author can use
> request.el to avoid imposing external dependencies such as curl to users while
> giving richer experience for users who have curl. -- [Source](https://tkf.github.io/emacs-request/)


### GET {#get}

Let's have a look how a simple (GET) API call looks like:

<a id="code-snippet--request-get-chuck-norris"></a>
```emacs-lisp
(let*
    ((httpRequest
      (request "https://api.chucknorris.io/jokes/random"
        :parser 'json-read
        :sync t
        :success (cl-function
                  (lambda (&key data &allow-other-keys)
                    (message "I sent: %S" data)))))

     (data (request-response-data httpRequest)))

  ;; Print information
 (cl-loop for (key . value) in data
      collect (cons key value)))
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--request-get-chuck-norris">Code Snippet 6</a>:</span>
  Get a random Chuck Norris joke
</div>

```emacs-lisp
((categories .
             [])
 (created_at . "2020-01-05 13:42:19.576875")
 (icon_url . "https://assets.chucknorris.host/img/avatar/chuck-norris.png")
 (id . "YNmylryESKCeA5-TJKm_9g")
 (updated_at . "2020-01-05 13:42:19.576875")
 (url . "https://api.chucknorris.io/jokes/YNmylryESKCeA5-TJKm_9g")
 (value . "The descendents of Chuck Norris have divided into two widely known cultures: New Jersey and New York."))
```
