org/blog.org
**** POST
Sending a ~POST~ request is also an easy task:

#+name: request_post_request_httpbin
#+caption: POST request with data
#+begin_src emacs-lisp  :exports both replace :results value code
(let*
    ((httpRequest
      (request "http://httpbin.org/post"
        :type "POST"
        :data '(("key" . "value") ("key2" . "value2"))
        :parser 'json-read
        :sync t
        :success (cl-function
                  (lambda (&key data &allow-other-keys)
                    (message "I sent: %S" data)))))

     (data (request-response-data httpRequest))
     (err (request-response-error-thrown httpRequest))
     (status (request-response-status-code httpRequest)))

  ;; Print information
 (cl-loop for (key . value) in data
      collect (cons key value)))
#+end_src

And here is the result:

#+RESULTS:
#+name: request_post_request_httpbin_response
#+caption: POST response as list of Elisp cons cells
#+begin_src emacs-lisp
((args)
 (data . "")
 (files)
 (form
  (key . "value")
  (key2 . "value2"))
 (headers
  (Accept . "*/*")
  (Accept-Encoding . "deflate, gzip, br, zstd")
  (Content-Length . "21")
  (Content-Type . "application/x-www-form-urlencoded")
  (Host . "httpbin.org")
  (User-Agent . "curl/7.83.1")
  (X-Amzn-Trace-Id . "Root=1-62cdbc5c-52d3ad32436c1cb8778808e5"))
 (json)
 (origin . "127.0.0.1")
 (url . "http://httpbin.org/post"))
#+end_src

*** Emacs
#+begin_src lisp :exports code :session tw5
;; default tiddlywiki base path
(setq tiddlywiki-base-path "http://127.0.0.1:8181/recipes/default/tiddlers/")
#+end_src


**** GET tiddler
Let's [[https://tiddlywiki.com/prerelease/static/WebServer%2520API%253A%2520Get%2520Tiddler.html][GET]] a tiddler:

#+caption: Get a tiddler by name ("Emacs")
#+name: request_get_tiddler_emacs
#+begin_src emacs-lisp :exports both :session tw5 :results value code
(let*
    ((httpRequest
      (request (concat tiddlywiki-base-path "Emacs")
        :parser 'json-read
        :sync t
        :success (cl-function
                  (lambda (&key data &allow-other-keys)
                    (message "I sent: %S" data)))))

     (data (request-response-data httpRequest))
     (err (request-response-error-thrown httpRequest))
     (status (request-response-status-code httpRequest)))

  ;; Print information
 (cl-loop for (key . value) in data
      collect (cons key value)))
#+end_src

#+RESULTS:
#+name: request_get_tiddler_emacs_response
#+caption: Response as list of Elisp cons cells
#+begin_src emacs-lisp
((title . "Emacs")
 (created . "20210623082136326")
 (modified . "20210623082138258")
 (tags . "Topics")
 (type . "text/vnd.tiddlywiki")
 (revision . 0)
 (bag . "default"))
#+end_src
