content/posts/2022-tiddlywiki-and-emacs.md


### POST {#post}

Sending a `POST` request is also an easy task:

<a id="code-snippet--request-post-request-httpbin"></a>
```emacs-lisp
(let*
    ((httpRequest
      (request "http://httpbin.org/post"
        :type "POST"
        :data '(("key" . "value") ("key2" . "value2"))
        :parser 'json-read
        :sync t
        :success (cl-function
                  (lambda (&key data &allow-other-keys)
                    (message "I sent: %S" data)))))

     (data (request-response-data httpRequest))
     (err (request-response-error-thrown httpRequest))
     (status (request-response-status-code httpRequest)))

  ;; Print information
 (cl-loop for (key . value) in data
      collect (cons key value)))
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--request-post-request-httpbin">Code Snippet 7</a>:</span>
  POST request with data
</div>

And here is the result:

<a id="code-snippet--request-post-request-httpbin-response"></a>
```emacs-lisp
((args)
 (data . "")
 (files)
 (form
  (key . "value")
  (key2 . "value2"))
 (headers
  (Accept . "*/*")
  (Accept-Encoding . "deflate, gzip, br, zstd")
  (Content-Length . "21")
  (Content-Type . "application/x-www-form-urlencoded")
  (Host . "httpbin.org")
  (User-Agent . "curl/7.83.1")
  (X-Amzn-Trace-Id . "Root=1-62cdbc5c-52d3ad32436c1cb8778808e5"))
 (json)
 (origin . "127.0.0.1")
 (url . "http://httpbin.org/post"))
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--request-post-request-httpbin-response">Code Snippet 8</a>:</span>
  POST response as list of Elisp cons cells
</div>


## Emacs {#emacs}

```lisp
;; default tiddlywiki base path
(setq tiddlywiki-base-path "http://127.0.0.1:8181/recipes/default/tiddlers/")
```


### GET tiddler {#get-tiddler}

Let's [GET](https://tiddlywiki.com/prerelease/static/WebServer%2520API%253A%2520Get%2520Tiddler.html) a tiddler:

<a id="code-snippet--request-get-tiddler-emacs"></a>
```emacs-lisp
(let*
    ((httpRequest
      (request (concat tiddlywiki-base-path "Emacs")
        :parser 'json-read
        :sync t
        :success (cl-function
                  (lambda (&key data &allow-other-keys)
                    (message "I sent: %S" data)))))

     (data (request-response-data httpRequest))
     (err (request-response-error-thrown httpRequest))
     (status (request-response-status-code httpRequest)))

  ;; Print information
 (cl-loop for (key . value) in data
      collect (cons key value)))
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--request-get-tiddler-emacs">Code Snippet 9</a>:</span>
  Get a tiddler by name ("Emacs")
</div>

<a id="code-snippet--request-get-tiddler-emacs-response"></a>
```emacs-lisp
((title . "Emacs")
 (created . "20210623082136326")
 (modified . "20210623082138258")
 (tags . "Topics")
 (type . "text/vnd.tiddlywiki")
 (revision . 0)
 (bag . "default"))
```

<div class="src-block-caption">
  <span class="src-block-number"><a href="#code-snippet--request-get-tiddler-emacs-response">Code Snippet 10</a>:</span>
  Response as list of Elisp cons cells
</div>
