org/blog.org
**** PUT a new tiddler
[[https://tiddlywiki.com/prerelease/static/WebServer%2520API%253A%2520Put%2520Tiddler.html][Creating a new tiddler]] is also simple. Using [[https://github.com/federicotdn/verb][ob-verb]]
#+begin_sidenote
This package is really helpful especially when you do literate programming with [[https://orgmode.org/worg/org-contrib/babel/][org-babel]].
#+end_sidenote

let's add a ~PUT~ request to the API:

#+caption: Sample request for creating a new tiddler
#+name: put_new_tiddler_pseudo
#+begin_src verb :wrap src shell
PUT http://127.0.0.1:8181/recipes/default/tiddlers/I%20love%20Elisp
x-requested-with: TiddlyWiki
Content-Type: application/json; charset=utf-8

{
    "title": "I love Elisp",
    "tags": "Emacs [[I Love]]",
    "send-with": "verb",
    "text": "This rocks!"
}
#+end_src

#+RESULTS: put_new_tiddler_pseudo
#+begin_src shell
HTTP/1.1 204 OK
Etag: "default/I%20love%20Elisp/8:"
Content-Type: text/plain
Date: Wed, 13 Jul 2022 10:03:24 GMT
Connection: keep-alive
Keep-Alive: timeout=5
#+end_src

Check if tiddler was indeed created:

#+caption: GET request using ~verb~
#+name: get_tiddler_verb
#+begin_src verb :wrap src shell
GET http://127.0.0.1:8181/recipes/default/tiddlers/I%20love%20Elisp
x-requested-with: TiddlyWiki
Accept: application/json; charset=utf-8
#+end_src

#+RESULTS:
#+caption: A new tiddler was created
#+name: put_new_tiddler_pseudo_response
#+begin_src http
HTTP/1.1 200 OK
Content-Type: application/json
Date: Wed, 13 Jul 2022 10:03:27 GMT
Connection: keep-alive
Keep-Alive: timeout=5
Transfer-Encoding: chunked

{
  "title": "I love Elisp",
  "tags": "Emacs [[I Love]]",
  "fields": {
    "send-with": "verb"
  },
  "text": "This rocks!",
  "revision": 1,
  "bag": "default",
  "type": "text/vnd.tiddlywiki"
}
#+end_src

Now let's translate that to ~request.el~ code. This I'll some extra complexity: I'll add
a function (~defun~) to ~PUT~ a new tiddler for us, where *name*, *tags* and *body* of the tiddler are variable.

#+name: request_insert_function
#+caption: Create new function for inserting new tiddlers
#+begin_src emacs-lisp :hl_lines 6,21,13 :exports both :session tw5 :results value code
;; Define function for inserting new tiddlers
(defun insert-tiddler(name tags body)
  (let*
  (
   (tiddler-title name)
   (url-path (url-hexify-string tiddler-title))
   (tiddler-tags tags)
   (tiddler-body body)

   (httpRequest
    (request (concat tiddlywiki-base-path url-path)
      :type "PUT"
      :data (json-encode
             `(
               ("title" . ,tiddler-title)
               ("created" . ,(format-time-string "%Y%m%d%H%M%S%3N"))
               ("modified" . ,(format-time-string "%Y%m%d%H%M%S%3N"))
               ("tags" . ,tiddler-tags)
               ("text" . ,tiddler-body)
               ("type" . "text/vnd.tiddlywiki")))
      :headers '(
                 ("Content-Type" . "application/json")
                 ("X-Requested-With" . "Tiddlywiki")
                 ("Accept" . "application/json"))
      :encoding 'utf-8
      :sync t
      :complete
      (function*
       (lambda (&key data &allow-other-keys)
         (message "Inside function: %s" data)
         (when data
           (with-current-buffer (get-buffer-create "*request demo*")
             (erase-buffer)
             (insert (request-response-data data))
             (pop-to-buffer (current-buffer))))))
      :error
      (function* (lambda (&key error-thrown &allow-other-keys&rest _)
                   (message "Got error: %S" error-thrown)))
      )))

  (format "%s:%s"
          (request-response-headers httpRequest)
          (request-response-status-code httpRequest)
          )))

;; Insert 2 tiddlers
(insert-tiddler "I love Elisp" "Elisp [[I Love]]" "This rocks!")
#+end_src

#+RESULTS: request_insert_function
#+caption: New tiddler was created
#+name: request_insert_function_created
#+begin_src emacs-lisp
"((etag . \"default/I%20love%20Elisp/61:\") (content-type . text/plain) (date . Wed, 13 Jul 2022 12:30:33 GMT) (connection . keep-alive) (keep-alive . timeout=5)):204"
#+end_src


Some explanations:
- in line 6 I URL encode the ~tiddler-title~
  - ~I love Elisp~ should become ~I%20love%20Elisp~
- in line 21 some headers are set
  - ~X-Requested-With~ is required to be set to ~TiddlyWiki~
  - ~Content-Type~ should be ~json~
  - we also accept ~json~ as a response
- in line 13 we specify the ~data~ to be sent to the API
  - each field (key, value sets) is set accordingly (see [[request_get_tiddler_emacs_response]])
  - I set the ~created~ and ~modified~ fields using ~format-time-string~

Now let's check again if tiddler really exists:

#+caption: Check if new tiddler exists
#+name: get_tiddler_verb_new_tiddler
#+begin_src :exports both verb :wrap src shell
GET http://127.0.0.1:8181/recipes/default/tiddlers/I%20love%20Elisp
x-requested-with: TiddlyWiki
Accept: application/json; charset=utf-8
#+end_src

#+RESULTS:
#+caption: It does exist!
#+name: get_tiddler_verb_new_tiddler_response
#+begin_src http
HTTP/1.1 200 OK
Content-Type: application/json
Date: Wed, 13 Jul 2022 12:40:22 GMT
Connection: keep-alive
Keep-Alive: timeout=5
Transfer-Encoding: chunked

{
  "title": "I love Elisp",
  "created": "20220713143033566",
  "modified": "20220713143033566",
  "tags": "Elisp [[I Love]]",
  "text": "This rocks!",
  "type": "text/vnd.tiddlywiki",
  "revision": 61,
  "bag": "default"
}
#+end_src


*** Use cases
Now what can you do with this little custom functions? Let me share my use cases.
