org/blog.org
**** Add bookmark
A bookmark in my TiddlyWiki represents a tiddler of following format:

#+begin_src verb :wrap src http :exports both
GET http://127.0.0.1:8181/recipes/default/tiddlers/chashell
Accept: application/json; charset=utf-8
#+end_src

#+RESULTS:
#+begin_src http :hl_lines 17,13,14,15
HTTP/1.1 200 OK
Content-Type: application/json
Date: Wed, 13 Jul 2022 12:49:58 GMT
Connection: keep-alive
Keep-Alive: timeout=5
Transfer-Encoding: chunked

{
  "title": "chashell",
  "created": "20210519103441485",
  "modified": "20210519103528982",
  "fields": {
    "name": "chashell",
    "note": "Chashell is a Go reverse shell that communicates over DNS. It can be used to bypass firewalls or tightly restricted networks.",
    "url": "https://github.com/sysdream/chashell"
  },
  "tags": "Golang Security Tool Bookmark",
  "type": "text/vnd.tiddlywiki",
  "revision": 0,
  "bag": "default"
}
#+end_src

Every bookmarks consists of a *name*, a *note* and an *url*. Every tiddler supposed to be a bookmark is tagged by ~Bookmark~. In this ~chashell~ is
a tiddler and at the same time a bookmark in my wiki.
#+begin_sidenote
This is the entry in my public Tiddlywiki instance: https://brainfck.org/#chashell.
#+end_sidenote

As part of my daily routine, I go through my [[/2021/09/01/inbox-zero-using-getpocket/][pocket entries]] and decide which ones I should bookmark in Tiddlywiki. These are my keybindings
for the getpocket major mode:

#+begin_src emacs-lisp :exports code :hl_lines 12
(map! :map pocket-reader-mode-map
      :after pocket-reader
      :nm "d" #'pocket-reader-delete
      :nm "SD" #'dorneanu/pocket-reader-send-to-dropbox
      :nm "a" #'pocket-reader-toggle-archived
      :nm "B" #'pocket-reader-open-in-external-browser
      :nm "e" #'pocket-reader-excerpt
      :nm "G" #'pocket-reader-more
      :nm "TAB" #'pocket-reader-open-url
      :nm "tr" #'pocket-reader-remove-tags
      :nm "tN" #'dorneanu/pocket-reader-remove-next
      :nm "C-b" #'dorneanu/tiddlywiki-add-bookmark
      :nm "ta" #'pocket-reader-add-tags
      :nm "gr" #'pocket-reader-refresh
      :nm "p" #'pocket-reader-search
      :nm "U" #'pocket-reader-unmark-all
      :nm "y" #'pocket-reader-copy-url
      :nm "Y" #'dorneanu/pocket-reader-copy-to-scratch)
#+end_src

Let's have a look at ~dorneanu/tiddlywiki-add-bookmark~:
#+begin_sidenote
Again: You can find all my customized functions in my [[https://github.com/dorneanu/dotfiles/blob/master/dot_doom.d/config.org#tiddlywiki][dotfiles]].
#+end_sidenote

#+caption: Bookmark entries from getpocket directly into Tiddlywiki
#+name: function_tiddlywiki_add_bookmark_getpocket
#+begin_src emacs-lisp :exports code
(defun dorneanu/tiddlywiki-add-bookmark ()
  "Adds a new bookmark to tiddlywiki. The URL is fetched from clipboard or killring"
    (require 'url-util)
    (interactive)
    (pocket-reader-copy-url)

    (setq my-url (org-web-tools--get-first-url))
    (setq url-html (org-web-tools--get-url my-url))
    (setq url-title (org-web-tools--html-title url-html))
    (setq url-title-mod (read-string "Title: " url-title))
    (setq url-path (url-hexify-string url-title-mod))
    (setq url-note (read-string (concat "Note for " my-url ":")))
    (setq url-tags (concat "Bookmark "(read-string "Additional tags: ")))

    (request (concat tiddlywiki-base-path url-path)
    :type "PUT"
    :data (json-encode `(("name" . ,url-title-mod) ("note" . ,url-note) ("url" . ,my-url) ("tags" . ,url-tags)))
    :headers '(("Content-Type" . "application/json") ("X-Requested-With" . "TiddlyWiki") ("Accept" . "application/json"))
    :parser 'json-read
    :success
    (cl-function
            (lambda (&key data &allow-other-keys)
                (message "I sent: %S" (assoc-default 'args data))))
    :complete (lambda (&rest _) (message "Added %s" (symbol-value 'url-title-mod)))
    :error (lambda (&rest _) (message "Some error"))
    :status-code '((400 . (lambda (&rest _) (message "Got 400.")))
                    (418 . (lambda (&rest _) (message "Got 418.")))
                    (204 . (lambda (&rest _) (message "Got 202."))))
    )
)
#+end_src






**** Add quote
After reading each book I usually do some post-reading/post-processing. While I could use the
Tiddlywiki web interface to add new tiddlers, I'd rather do it from Emacs directly.

Often I need to insert new quotes from book (or web articles). How to I do this:

#+caption: Directly add new quotes from Emacs
#+name: function_tiddlywiki_add_quote
#+begin_src emacs-lisp :exports code
(defun dorneanu/tiddlywiki-add-quote ()
  "Adds a new quote"
    (interactive)

    (setq quote-title (read-string "Quote title: " quote-title))
    (setq url-path (url-hexify-string quote-title))
    (setq quote-source (read-string (concat "Source for " quote-title ": ") quote-source))
    (setq quote-body (read-string (concat "Text for " quote-title ": ")))
    (setq quote-tags (concat "quote "(read-string "Additional tags: ")))

    (request (concat tiddlywiki-base-path url-path)
    :type "PUT"
    :data (json-encode `(
        ("title" . ,quote-title)
        ("created" . ,(format-time-string "%Y%m%d%H%M%S%3N"))
        ("modified" . ,(format-time-string "%Y%m%d%H%M%S%3N"))
        ("source" . ,quote-source)
        ("tags" . ,quote-tags)
        ("text" . ,quote-body)
        ("type" . "text/vnd.tiddlywiki")))
    :headers '(("Content-Type" . "application/json") ("X-Requested-With" . "TiddlyWiki") ("Accept" . "application/json"))
    :parser 'json-read
    :success
    (cl-function
            (lambda (&key data &allow-other-keys)
                (message "I sent: %S" (assoc-default 'args data))))
    :complete (lambda (&rest _) (message "Added quote <%s>" (symbol-value 'quote-title)))
    :error (lambda (&rest _) (message "Some error"))
    :status-code '((400 . (lambda (&rest _) (message "Got 400.")))
                    (418 . (lambda (&rest _) (message "Got 418.")))
                    (204 . (lambda (&rest _) (message "Got 202."))))
    )
)
#+end_src

I simply invoke ~M-x dorneanu/tiddlywiki-add-quote~ and ~read-string~ will ask for a quote title, some source of the quote (e.g. a book)
and of course the actual text.
*** Hydra
I've recently discovered [[https://github.com/abo-abo/hydra][hydra]] and I came up with some hydra also for TiddlyWiki:

#+caption: Hydra for Tiddlywiki
#+name: tiddlywiki_customized_hydra
#+begin_src emacs-lisp :exports code
(defhydra hydra-tiddlywiki (:color blue :hint nil)
"
Tiddlywiki commands^
---------------------------------------------------------
_b_ Add new bookmark
_j_ Add new journal entry
_t_ Add new tiddler
_q_ Add new quote
"
  ("b" dorneanu/tiddlywiki-add-bookmark)
  ("j" vd/tw5-journal-file-by-date)
  ("q" dorneanu/tiddlywiki-add-quote)
  ("t" dorneanu/tiddlywiki-add-tiddler))

;; Keybindings
(my-leader-def
  :infix "m w"
  "h" '(hydra-tiddlywiki/body :which-key "Open Tiddlywiki hydra")
  "j" '(vd/tw5-journal-file-by-date :which-key "Create/Open TW5 Journal file")
  "s" '(my/rg-tiddlywiki-directory :which-key "Search in TW5 directory"))
#+end_src

This way I press ~M m w h~ and the TiddlyWiki hydra will pop up.
*** Conclusion
I hope some day there will be a full (elisp) package for TiddlyWiki combining some of the
functionalities/ideas mentioned here. If you have anything to add/share, please let me know.

